In [1]:
# %load c:/bi/bi.py
from scipy.stats import ttest_ind, pearsonr, spearmanr, mannwhitneyu
from warnings import filterwarnings as wfw
import datetime as dt
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import random as rm
import scipy.stats as st
import seaborn as sns

In [2]:
orders = pd.read_csv('orders.csv', parse_dates=['Departure Date', 'Arrival Date', 'Created Date'])
orders.columns = ['user_id', 'order_id', 'transation_value', 'commission', 'processing_cost',
                  'promocode_cost', 'intergation_cost', 'destination_id', 'departure_date',
                  'arrival_date', 'created_date']
region = pd.read_csv('region.csv')
region.columns = ['region_id', 'name', 'level', 'language']
users = pd.read_csv('users.csv', parse_dates=['Created Date'])
users.columns = ['user_id', 'region_id', 'created_date', 'language', 'role', 'status']

---

In [3]:
orders.head(4)

,user_id,order_id,transation_value,commission,processing_cost,promocode_cost,intergation_cost,destination_id,departure_date,arrival_date,created_date
0,121100,1110022,5547,632.358,245.7321,150.0,137.5656,413,2020-03-30,2020-03-11,2020-01-10
1,121100,1110001,5836,490.224,258.5348,50.0,NaN,1132,2020-09-03,2020-08-17,2020-06-06
2,121100,1110004,5181,538.824,241.4346,100.0,123.8259,173,2020-02-11,2020-01-14,2019-12-06
3,121100,1110010,3653,292.240,172.7869,50.0,NaN,1098,2020-03-18,2020-03-03,2020-02-28

In [4]:
region.head(4)

   region_id          name level language
0          3      Abenberg     V       de
1          5     Abensberg     V       de
2          9  Augustusburg     V       de
3         11     Adelsheim     V       de

In [5]:
users.head(4)

   user_id  region_id created_date language     role   status
0   121100        755   2019-11-28       en   master  deleted
1   121102       1174   2020-04-02       fr  finance  deleted
2   121105       1267   2021-03-09       se  finance   active
3   121108        763   2019-04-05       en  manager   active

---

In [6]:
# temp = pd.merge(orders, users, how='left', left_on='user_id', right_on='user_id', suffixes = ('_or', '_us'))

# temp

In [7]:
years = np.arange(2019,2023)
years

array([2019, 2020, 2021, 2022])

In [8]:
orders.groupby([orders['created_date'].dt.year.rename('year'),
                orders['created_date'].dt.month.rename('month'),
                orders['user_id']])['order_id'].count().reset_index()

       year  month  user_id  order_id
0      2019      1   121145         2
1      2019      1   121767         1
2      2019      1   121867         1
3      2019      1   121998         1
4      2019      1   122019         4
...     ...    ...      ...       ...
26334  2022      6   129802         1
26335  2022      6   130169         1
26336  2022      6   130274         1
26337  2022      6   130314         1
26338  2022      6   130612         2

[26339 rows x 4 columns]